FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_SPI.c
/*-------------------------------------------------------------------------*
 * File:  RX62N_SPI.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the RX62N SPI Bus Interface.
 * Implementation:
 *      The RSPI0 and RSPI1 interface of the RX62N are mapped to standard
 *      SPI request handlers.
 *      Master only.
 *      Currently, only polled.
 *      This current implementation does NOT use the SSL lines for CS
 *      or slave selection.  It only uses a GPIO line defined in the
 *      configuration.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2010 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <uEZ.h>
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <HAL/SPI.h>
#include <HAL/GPIO.h>
#include "RX62N_UtilityFuncs.h"
#include "RX62N_SPI.h"

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
#if (COMPILER_TYPE==RenesasRX)
    typedef volatile struct st_rspi __evenaccess T_RX62N_SPI_Registers;
#endif

typedef struct {
    const HAL_SPI *iHAL;
    T_RX62N_SPI_Registers *iReg;
    TUInt8 iMSTPBit;
} T_RX62N_SPI_Workspace;

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
static const TUInt8 G_bitMapping[32+1] = {
    0xFF,           // 0 bits
    0xFF,           // 1 bit
    0xFF,           // 2 bit
    0xFF,           // 3 bit
    0xFF,           // 4 bit
    0xFF,           // 5 bit
    0xFF,           // 6 bit
    0xFF,           // 7 bit
    7,              // 8 bits
    8,              // 9 bits
    9,              // 10 bits
    10,             // 11 bits
    11,             // 12 bits
    12,             // 13 bits
    13,             // 14 bits
    14,             // 15 bits
    15,             // 16 bits
    0xFF,           // 17 bits
    0xFF,           // 18 bits
    0xFF,           // 19 bits
    0,              // 20 bits
    0xFF,           // 21 bits
    0xFF,           // 22 bits
    0xFF,           // 23 bits
    1,              // 24 bits
    0xFF,           // 25 bits
    0xFF,           // 26 bits
    0xFF,           // 27 bits
    0xFF,           // 28 bits
    0xFF,           // 29 bits
    0xFF,           // 30 bits
    0xFF,           // 31 bits
    2,              // 32 bits
};

static const SPI_Request G_defaultSPIRequest = {
    0, // iDataMOSI
    0, // iDataMISO
    0, // iNumTransfers
    8, // iBitsPerTransfer (8 bits default)
    1000, // iRate (1000 kHz or 1 MHz default)
    EFalse, // iClockOutPolarity
    EFalse, // iClockOutPhase
    0, // iCSGPIOPort
    0, // iCSGPIOBit
    EFalse, // iCSPolarity
};

/*---------------------------------------------------------------------------*
 * Routine:  ISPIStart
 *---------------------------------------------------------------------------*
 * Description:
 *      SPI is going to start -- chip select enabled for device
 * Outputs:
 *      SPI_Request *aRequest      -- Configuration of SPI device
 *---------------------------------------------------------------------------*/
static void ISPIStart(SPI_Request *aRequest)
{ 
    if (aRequest->iCSPolarity)  {
        (*aRequest->iCSGPIOPort)->Set(
                aRequest->iCSGPIOPort, 
                aRequest->iCSGPIOBit);
    } else {
        (*aRequest->iCSGPIOPort)->Clear(
                aRequest->iCSGPIOPort, 
                aRequest->iCSGPIOBit);
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  ISPIEnd
 *---------------------------------------------------------------------------*
 * Description:
 *      SPI is going to end -- chip select disabled for device
 * Outputs:
 *      SPI_Request *aRequest      -- Configuration of SPI device
 *---------------------------------------------------------------------------*/
static void ISPIEnd(SPI_Request *aRequest)
{
    if (aRequest->iCSPolarity)  {
        (*(aRequest->iCSGPIOPort))->Clear(
                aRequest->iCSGPIOPort, 
                aRequest->iCSGPIOBit);
    } else {
        (*(aRequest->iCSGPIOPort))->Set(
                aRequest->iCSGPIOPort, 
                aRequest->iCSGPIOBit);
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  ISPIConfig
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure the SPI for the particular SPI request.
 * Outputs:
 *      T_RX62N_SPI_Workspace *aW -- Particular SPI workspace
 *      SPI_Request *aRequest      -- Configuration of SPI device
 *---------------------------------------------------------------------------*/
static void ISPIConfig(T_RX62N_SPI_Workspace *aW, SPI_Request *aRequest)
{
    T_RX62N_SPI_Registers *p = aW->iReg;

    // Ensure the SPI is on
    SYSTEM.MSTPCRB.LONG &= ~(1<<aW->iMSTPBit);

    // Disable/reset RSPI for the moment
    p->SPCR.BIT.SPE = 0;

    if (aRequest->iCSGPIOPort) {
        // Set the CS as an output io pin
        (*(aRequest->iCSGPIOPort))->SetOutputMode(
                aRequest->iCSGPIOPort, 
                aRequest->iCSGPIOBit);
    }
    
    // Not loopback and using CMOS output
    p->SPPCR.BYTE = 0x00;

    // Calculate the bit rate divider (assuming the BRDV[1:0] values are always 0)
    // TBD: At some point we should calculate BRDV[1:0] for the commands
    //      and use this value.  For now this limits the range of speeds
    //      to higher speeds.  (e.g. 32 MHz / 256 = 125 kHz as slowest rate)
    if ((2*aRequest->iRate) >= (BCLK_FREQUENCY/1000))
        p->SPBR.BYTE = 0; // maximum speed
    else
        p->SPBR.BYTE = ((BCLK_FREQUENCY/1000)-1)/(2*aRequest->iRate);

    // RSPI Data Control Register (SPDCR)
    //  00-- ----   Reserved
    //  --0- ----   SPLW = Access SPDR in long words
    //  ---0 ----   SPRDTD = SPDR values are read from the receive buffer
    //  ---- 00--   SLSEL[1:0] = SSL[3:0] are outputs (not used)
    //  ---- --00   SPFC[1:0] = These bits specify the number of frames that
    //              can be stored in SPDR.  For, this configuration:
    //              1 transfer per access, 1 buffered
    p->SPDCR.BYTE = 0x00;

