FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_SPI.c
    // Doing one transfer
    // Send the SPI data (this also triggers a read in)
    p->SPDR.WORD.L = (TUInt16) (aSend >> 16);
    p->SPDR.WORD.H = (TUInt16) (aSend & 0xFFFF);

    // Wait until SPI done
    while (p->SPSR.BIT.IDLNF);

    recv = p->SPDR.LONG;

    return recv;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_SPI_Stop
 *---------------------------------------------------------------------------*
 * Description:
 *      The SPI transfer(s) are complete.  End the SPI by flipping
 *      the chip select.
 * Inputs:
 *      void *aWorkspace            -- Particular SPI workspace
 *      SPI_Request *aRequest       -- Request settings to process
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
void RX62N_SPI_Stop(
        void *aWorkspace,
        SPI_Request *aRequest)
{
    ISPIEnd(aRequest);
}

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_SPI SPI_RX62N_RSPI0_Interface = {
    "RX62N:SPI0",
    0x0100,
    RX62N_SPI_RSPI0_InitializeWorkspace,
    sizeof(T_RX62N_SPI_Workspace),

    RX62N_SPI_TransferPolled,

    RX62N_SPI_Start,
    RX62N_SPI_TransferInOut,
    RX62N_SPI_Stop,
    RX62N_SPI_TransferInOutBytes,
};

const HAL_SPI SPI_RX62N_RSPI1_Interface = {
    "RX62N:SPI1",
    0x0100,
    RX62N_SPI_RSPI1_InitializeWorkspace,
    sizeof(T_RX62N_SPI_Workspace),

    RX62N_SPI_TransferPolled,

    RX62N_SPI_Start,
    RX62N_SPI_TransferInOut,
    RX62N_SPI_Stop,
    RX62N_SPI_TransferInOutBytes,
};

void RX62N_RSPI0_A_Require(void)
{
	static const T_uezGPIOPortPin pins[] = {
           	GPIO_PC5,  	// RSPCKA-A
			GPIO_PC6,	// MOSIA-A
			GPIO_PC7,	// MISOA-A
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("RSPI0", (T_halInterface *)&SPI_RX62N_RSPI0_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	IOPORT.PFGSPI.BYTE = 0x0E;	// Select & enable RSPI0-A pins
	PORTC.ICR.BIT.B7 = 1; 		// Turn on PC7 (MISOA-A) input buffer 
}

void RX62N_RSPI0_B_Require(void)
{
	static const T_uezGPIOPortPin pins[] = {
           	GPIO_PA5,  	// RSPICKA-B
			GPIO_PA6,	// MOSIA-B
			GPIO_PA7	// MISOA-B
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("RSPI0", (T_halInterface *)&SPI_RX62N_RSPI0_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	IOPORT.PFGSPI.BYTE = 0x0F;	// Select & enable RSPI0-B pins
	PORTA.ICR.BIT.B7 = 1; 		// Turn on PA7 (MISOA-A) input buffer 
}

void RX62N_RSPI1_A_Require(void)
{
	static const T_uezGPIOPortPin pins[] = {
           	GPIO_P27,  	// RSPCKB-A
			GPIO_P26,	// MOSIB-A
			GPIO_P30	// MISOB-A
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("RSPI1", (T_halInterface *)&SPI_RX62N_RSPI1_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));

	IOPORT.PFHSPI.BYTE = 0x0E;		// Select & enable RSPI1-A pins
	PORT3.ICR.BIT.B0 = 1; 			// Turn on P30 (MISOB-A) input buffer 
}

void RX62N_RSPI1_B_Require(void)
{
	static const T_uezGPIOPortPin pins[] = {
           	GPIO_PE5,  	// RSPCKB-B
			GPIO_PE6,	// MOSIB-B
			GPIO_PE7	// MISOB-B
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("RSPI1", (T_halInterface *)&SPI_RX62N_RSPI1_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	IOPORT.PFHSPI.BYTE = 0x0F;		// Select & enable RSPI1-B pins
	PORTE.ICR.BIT.B7 = 1; 			// Turn on PE7 (MISOB-B) input buffer 
}

/*-------------------------------------------------------------------------*
 * End of File:  RX62N_SPI.c
 *-------------------------------------------------------------------------*/

